Revit 2027 API
BuiltInFailures.DimensionFailures.RegenConstraintUnsatisfied Property
 Constraints are not satisfied
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegenConstraintUnsatisfied { get; }
Public Shared ReadOnly Property RegenConstraintUnsatisfied As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegenConstraintUnsatisfied {
	FailureDefinitionId^ get ();
}
static member RegenConstraintUnsatisfied : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace